<!-- dflook/terraform-github-actions {"workspace":"hushline-dev-407-url-prefix","backend_type":"remote","backend":"4415827c2a325f6d8531de3baa158f9531efd78a9affb009baad6dc7dc016ed1","plan_job_ref":"Job Deploy/Destroy Branch Dev Environment #119 at https://github.com/scidsg/hushline/actions/runs/9964072742","plan_out_hash":"447edc84d77b78a54769c726e74bec3dcc651346ab20eb89b168f61766450328","plan_hash":"0a6103085bcf5dce5a27a5c86c9b8e2bc5c85586920004543daf332a98622b2f","plan_text_format":"diff","version":"1.43.0"} -->
Terraform plan in __terraform/dev__ in the __hushline-dev-407-url-prefix__ workspace<details open><summary>With variables</summary>

```hcl
branch = "407-url-prefix"
name   = "hushline-dev-407-url-prefix"
```
</details>
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # digitalocean_project.hush_line_dev will be created
+   resource "digitalocean_project" "hush_line_dev" {
+       created_at  = (known after apply)
+       description = "Development instance based on the 407-url-prefix branch"
+       environment = "Development"
+       id          = (known after apply)
+       is_default  = false
+       name        = "hushline-dev-407-url-prefix"
+       owner_id    = (known after apply)
+       owner_uuid  = (known after apply)
+       purpose     = "Web Application"
+       resources   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.app.digitalocean_app.app will be created
+   resource "digitalocean_app" "app" {
+       active_deployment_id = (known after apply)
+       created_at           = (known after apply)
+       default_ingress      = (known after apply)
+       id                   = (known after apply)
+       live_url             = (known after apply)
+       project_id           = (known after apply)
+       updated_at           = (known after apply)
+       urn                  = (known after apply)

+       dedicated_ips (known after apply)

+       spec {
+           domains = (known after apply)
+           name    = "hushline-dev-407-url-prefix"
+           region  = "sfo"

+           alert {
+               disabled = false
+               rule     = "DEPLOYMENT_FAILED"
            }

+           domain (known after apply)

+           ingress (known after apply)

+           service {
+               dockerfile_path    = "Dockerfile"
+               http_port          = 8080
+               instance_count     = 1
+               instance_size_slug = "apps-s-1vcpu-0.5gb"
+               internal_ports     = (known after apply)
+               name               = "app"
+               run_command        = (known after apply)

+               github {
+                   branch         = "407-url-prefix"
+                   deploy_on_push = true
+                   repo           = "scidsg/hushline"
                }

+               health_check {
+                   http_path = "/health.json"
                }

+               routes (known after apply)
            }
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   app_live_url = (known after apply)
```
</details>

:memo: Plan generated in [Deploy/Destroy Branch Dev Environment #119](https://github.com/scidsg/hushline/actions/runs/9964072742)